#ifndef _SERVICEMENUBOOK_H_
#define _SERVICEMENUBOOK_H_

typedef struct _ServiceMenuBook : BOOK
{
  char dummy_0x18[0x4]; // 0x18 
  char dummy_0x1C[0x4]; // 0x1C
  GUI* gui;             // 0x20
  u16  cur_pos;         // 0x24
  char dummy_0x26[0x2]; // 0x26
  char dummy_0x28[0x4]; // 0x28
  char dummy_0x2C[0x4]; // 0x2C
  char dummy_0x30[0x2]; // 0x30
  char dummy_0x34[0x4]; // 0x34
  char dummy_0x38[0x4]; // 0x38
  char dummy_0x3C[0x2]; // 0x3C
  char dummy_0x40[0x4]; // 0x40
  char dummy_0x44[0x4]; // 0x44
  char dummy_0x48[0x2]; // 0x48
  char dummy_0x4C[0x4]; // 0x4C
  char dummy_0x50[0x4]; // 0x50
  char dummy_0x54[0x2]; // 0x54
  char dummy_0x58[0x4]; // 0x58
  char dummy_0x5C[0x4]; // 0x5C
  char dummy_0x60[0x2]; // 0x60
  GUI* dummy_0x64;      // 0x64
  char dummy_0x68[0x4]; // 0x68
}ServiceMenuBook;

#endif
